from random import randint

# 候选字
chars_male ='涛昌进林大有坚和彪博诚先敬震振年壮会群豪心邦承乐绍功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗祖伯仲季叔宏言若鸣朋斌梁栋维启克伦翔旭鹏泽晨辰士以建家致树炎德行时泰盛雄琛钧冠策腾伟刚勇毅俊峰芸强军华平保东文辉丁力明永健春杰世广志义兴良海山仁波宁贵福生龙元全国胜学祥才发成康星光天达安岩中茂武新利雷清飞彬传富顺信子杰楠风航弘夏景来上源可一多名从高九与见正本西南北书再越全智少青千观通原品象近远岳连夜久易居吴京阳雨导展闻舟洲鱼农权鲁宝右左章冲楼乡野承'

chars_female = '嘉琼桂叶璧璐娅琦晶妍鼎茜秋珊锦青婉娴瑾颖露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚婕馨瑗琰韵园艺咏卿澜纯毓悦昭冰爽琬茗羽希宁欣飘育滢柔竹霭凝晓欢霄枫芸菲宜可舒影思丽安秀娟多英高华慧飞巧美乐静淑惠珠行翠雅芝玉芸萍红玲芬芳燕春珍贞莉兰洁梅琳素云莲真雪爱家妹霞香月莺艳瑞凡佳寻言子自墨上见如南北紫远清音林久苏吴睛雨舟闻宝景洛夏乡文'

while True:
    gender = input('请选择您的性别 ( 1-女 2-男 ) ：')
    if gender!='1' and gender!='2':
        print('输入错误，请重新输入')
    else:
        break

chars = chars_female if gender == '1' else chars_male


max = len(chars)
while True:
    idx1,idx2 = randint(0,max-1), randint(0,max-1)
    print(f'{chars[idx1]}{chars[idx2]}',end='')
    # 直接回车继续，输入其他按键回车退出
    key = input('')
    if key :
        break